dblockil42/UsingF28379D_ForMechatronics/C2000Ware_4_01_00_00/device_support/f2837xd/examples/cpu1/boostxl_afe031_f28379d_rx/cpu01/boostxl_afe031_f28379d_rx_isr.h
#if (G1_12PL >= G1_1PL) || (G1_12PL == 0)
#define  MG1_1_112PL    ~(1 << 11)
#else
#define  MG1_1_112PL    0xFFFF
#endif

#if (G1_13PL >= G1_1PL) || (G1_13PL == 0)
#define  MG1_1_113PL    ~(1 << 12)
#else
#define  MG1_1_113PL    0xFFFF
#endif

#if (G1_14PL >= G1_1PL) || (G1_14PL == 0)
#define  MG1_1_114PL    ~(1 << 13)
#else
#define  MG1_1_114PL    0xFFFF
#endif

#if (G1_15PL >= G1_1PL) || (G1_15PL == 0)
#define  MG1_1_115PL    ~(1 << 14)
#else
#define  MG1_1_115PL    0xFFFF
#endif

#if (G1_16PL >= G1_1PL) || (G1_16PL == 0)
#define  MG1_1_116PL    ~(1 << 15)
#else
#define  MG1_1_116PL    0xFFFF
#endif

#define  MG1_1_11PL	0xFFFE
#define  MG1_1    (MG1_1_11PL & MG1_1_12PL & MG1_1_13PL & MG1_1_14PL & \
                    MG1_1_15PL & MG1_1_16PL & MG1_1_17PL & MG1_1_18PL & \
                    MG1_1_19PL & MG1_1_110PL & MG1_1_111PL & MG1_1_112PL & \
                    MG1_1_113PL & MG1_1_114PL & MG1_1_115PL & MG1_1_116PL)
// End of MG1_1:
// Beginning of MG12:
#if (G1_1PL >= G1_2PL) || (G1_1PL == 0)
#define  MG1_2_11PL    ~(1 << 0)
#else
#define  MG1_2_11PL    0xFFFF
#endif

#if (G1_3PL >= G1_2PL) || (G1_3PL == 0)
#define  MG1_2_13PL    ~(1 << 2)
#else
#define  MG1_2_13PL    0xFFFF
#endif

#if (G1_4PL >= G1_2PL) || (G1_4PL == 0)
#define  MG1_2_14PL    ~(1 << 3)
#else
#define  MG1_2_14PL    0xFFFF
#endif

#if (G1_5PL >= G1_2PL) || (G1_5PL == 0)
#define  MG1_2_15PL    ~(1 << 4)
#else
#define  MG1_2_15PL    0xFFFF
#endif

#if (G1_6PL >= G1_2PL) || (G1_6PL == 0)
#define  MG1_2_16PL    ~(1 << 5)
#else
#define  MG1_2_16PL    0xFFFF
#endif

#if (G1_7PL >= G1_2PL) || (G1_7PL == 0)
#define  MG1_2_17PL    ~(1 << 6)
#else
#define  MG1_2_17PL    0xFFFF
#endif

#if (G1_8PL >= G1_2PL) || (G1_8PL == 0)
#define  MG1_2_18PL    ~(1 << 7)
#else
#define  MG1_2_18PL    0xFFFF
#endif

#if (G1_9PL >= G1_2PL) || (G1_9PL == 0)
#define  MG1_2_19PL    ~(1 << 8)
#else
#define  MG1_2_19PL    0xFFFF
#endif

#if (G1_10PL >= G1_2PL) || (G1_10PL == 0)
#define  MG1_2_110PL    ~(1 << 9)
#else
#define  MG1_2_110PL    0xFFFF
#endif

#if (G1_11PL >= G1_2PL) || (G1_11PL == 0)
#define  MG1_2_111PL    ~(1 << 10)
#else
#define  MG1_2_111PL    0xFFFF
#endif

#if (G1_12PL >= G1_2PL) || (G1_12PL == 0)
#define  MG1_2_112PL    ~(1 << 11)
#else
#define  MG1_2_112PL    0xFFFF
#endif

#if (G1_13PL >= G1_2PL) || (G1_13PL == 0)
#define  MG1_2_113PL    ~(1 << 12)
#else
#define  MG1_2_113PL    0xFFFF
#endif

#if (G1_14PL >= G1_2PL) || (G1_14PL == 0)
#define  MG1_2_114PL    ~(1 << 13)
#else
#define  MG1_2_114PL    0xFFFF
#endif

#if (G1_15PL >= G1_2PL) || (G1_15PL == 0)
#define  MG1_2_115PL    ~(1 << 14)
#else
#define  MG1_2_115PL    0xFFFF
#endif

#if (G1_16PL >= G1_2PL) || (G1_16PL == 0)
#define  MG1_2_116PL    ~(1 << 15)
#else
#define  MG1_2_116PL    0xFFFF
#endif

#define  MG1_2_12PL	0xFFFD
#define  MG1_2    (MG1_2_11PL & MG1_2_12PL & MG1_2_13PL & MG1_2_14PL & \
                    MG1_2_15PL & MG1_2_16PL & MG1_2_17PL & MG1_2_18PL & \
                    MG1_2_19PL & MG1_2_110PL & MG1_2_111PL & MG1_2_112PL & \
                    MG1_2_113PL & MG1_2_114PL & MG1_2_115PL & MG1_2_116PL)
// End of MG1_2:
// Beginning of MG13:
#if (G1_1PL >= G1_3PL) || (G1_1PL == 0)
#define  MG1_3_11PL    ~(1 << 0)
#else
#define  MG1_3_11PL    0xFFFF
#endif

#if (G1_2PL >= G1_3PL) || (G1_2PL == 0)
#define  MG1_3_12PL    ~(1 << 1)
#else
#define  MG1_3_12PL    0xFFFF
#endif

#if (G1_4PL >= G1_3PL) || (G1_4PL == 0)
#define  MG1_3_14PL    ~(1 << 3)
#else
#define  MG1_3_14PL    0xFFFF
#endif

#if (G1_5PL >= G1_3PL) || (G1_5PL == 0)
#define  MG1_3_15PL    ~(1 << 4)
#else
#define  MG1_3_15PL    0xFFFF
#endif

#if (G1_6PL >= G1_3PL) || (G1_6PL == 0)
#define  MG1_3_16PL    ~(1 << 5)
#else
#define  MG1_3_16PL    0xFFFF
#endif

#if (G1_7PL >= G1_3PL) || (G1_7PL == 0)
#define  MG1_3_17PL    ~(1 << 6)
#else
#define  MG1_3_17PL    0xFFFF
#endif

#if (G1_8PL >= G1_3PL) || (G1_8PL == 0)
#define  MG1_3_18PL    ~(1 << 7)
#else
#define  MG1_3_18PL    0xFFFF
#endif

#if (G1_9PL >= G1_3PL) || (G1_9PL == 0)
#define  MG1_3_19PL    ~(1 << 8)
#else
#define  MG1_3_19PL    0xFFFF
#endif

#if (G1_10PL >= G1_3PL) || (G1_10PL == 0)
#define  MG1_3_110PL    ~(1 << 9)
#else
#define  MG1_3_110PL    0xFFFF
#endif

#if (G1_11PL >= G1_3PL) || (G1_11PL == 0)
#define  MG1_3_111PL    ~(1 << 10)
#else
#define  MG1_3_111PL    0xFFFF
#endif

#if (G1_12PL >= G1_3PL) || (G1_12PL == 0)
#define  MG1_3_112PL    ~(1 << 11)
#else
#define  MG1_3_112PL    0xFFFF
#endif

#if (G1_13PL >= G1_3PL) || (G1_13PL == 0)
#define  MG1_3_113PL    ~(1 << 12)
#else
#define  MG1_3_113PL    0xFFFF
#endif

#if (G1_14PL >= G1_3PL) || (G1_14PL == 0)
#define  MG1_3_114PL    ~(1 << 13)
#else
#define  MG1_3_114PL    0xFFFF
#endif

#if (G1_15PL >= G1_3PL) || (G1_15PL == 0)
#define  MG1_3_115PL    ~(1 << 14)
#else
#define  MG1_3_115PL    0xFFFF
#endif

#if (G1_16PL >= G1_3PL) || (G1_16PL == 0)
#define  MG1_3_116PL    ~(1 << 15)
#else
#define  MG1_3_116PL    0xFFFF
#endif

#define  MG1_3_13PL	0xFFFB
#define  MG1_3    (MG1_3_11PL & MG1_3_12PL & MG1_3_13PL & MG1_3_14PL & \
                    MG1_3_15PL & MG1_3_16PL & MG1_3_17PL & MG1_3_18PL & \
                    MG1_3_19PL & MG1_3_110PL & MG1_3_111PL & MG1_3_112PL & \
                    MG1_3_113PL & MG1_3_114PL & MG1_3_115PL & MG1_3_116PL)
// End of MG1_3:
// Beginning of MG14:
#if (G1_1PL >= G1_4PL) || (G1_1PL == 0)
#define  MG1_4_11PL    ~(1 << 0)
#else
#define  MG1_4_11PL    0xFFFF
#endif

#if (G1_2PL >= G1_4PL) || (G1_2PL == 0)
#define  MG1_4_12PL    ~(1 << 1)
#else
#define  MG1_4_12PL    0xFFFF
#endif

#if (G1_3PL >= G1_4PL) || (G1_3PL == 0)
#define  MG1_4_13PL    ~(1 << 2)
#else
#define  MG1_4_13PL    0xFFFF
#endif

#if (G1_5PL >= G1_4PL) || (G1_5PL == 0)
#define  MG1_4_15PL    ~(1 << 4)
#else
#define  MG1_4_15PL    0xFFFF
#endif

#if (G1_6PL >= G1_4PL) || (G1_6PL == 0)
#define  MG1_4_16PL    ~(1 << 5)
#else
#define  MG1_4_16PL    0xFFFF
#endif

#if (G1_7PL >= G1_4PL) || (G1_7PL == 0)
#define  MG1_4_17PL    ~(1 << 6)
#else
#define  MG1_4_17PL    0xFFFF
#endif

#if (G1_8PL >= G1_4PL) || (G1_8PL == 0)
#define  MG1_4_18PL    ~(1 << 7)
#else
#define  MG1_4_18PL    0xFFFF
#endif

#if (G1_9PL >= G1_4PL) || (G1_9PL == 0)
#define  MG1_4_19PL    ~(1 << 8)
#else
#define  MG1_4_19PL    0xFFFF
#endif

#if (G1_10PL >= G1_4PL) || (G1_10PL == 0)
#define  MG1_4_110PL    ~(1 << 9)
#else
#define  MG1_4_110PL    0xFFFF
#endif

#if (G1_11PL >= G1_4PL) || (G1_11PL == 0)
#define  MG1_4_111PL    ~(1 << 10)
#else
#define  MG1_4_111PL    0xFFFF
#endif

