dblockil42/UsingF28379D_ForMechatronics/C2000Ware_4_01_00_00/device_support/f2837xd/examples/cpu1/boostxl_afe031_f28379d_rx/cpu01/boostxl_afe031_f28379d_rx_isr.h
#if (G1_12PL >= G1_4PL) || (G1_12PL == 0)
#define  MG1_4_112PL    ~(1 << 11)
#else
#define  MG1_4_112PL    0xFFFF
#endif

#if (G1_13PL >= G1_4PL) || (G1_13PL == 0)
#define  MG1_4_113PL    ~(1 << 12)
#else
#define  MG1_4_113PL    0xFFFF
#endif

#if (G1_14PL >= G1_4PL) || (G1_14PL == 0)
#define  MG1_4_114PL    ~(1 << 13)
#else
#define  MG1_4_114PL    0xFFFF
#endif

#if (G1_15PL >= G1_4PL) || (G1_15PL == 0)
#define  MG1_4_115PL    ~(1 << 14)
#else
#define  MG1_4_115PL    0xFFFF
#endif

#if (G1_16PL >= G1_4PL) || (G1_16PL == 0)
#define  MG1_4_116PL    ~(1 << 15)
#else
#define  MG1_4_116PL    0xFFFF
#endif

#define  MG1_4_14PL	0xFFF7
#define  MG1_4    (MG1_4_11PL & MG1_4_12PL & MG1_4_13PL & MG1_4_14PL & \
                    MG1_4_15PL & MG1_4_16PL & MG1_4_17PL & MG1_4_18PL & \
                    MG1_4_19PL & MG1_4_110PL & MG1_4_111PL & MG1_4_112PL & \
                    MG1_4_113PL & MG1_4_114PL & MG1_4_115PL & MG1_4_116PL)
// End of MG1_4:
// Beginning of MG15:
#if (G1_1PL >= G1_5PL) || (G1_1PL == 0)
#define  MG1_5_11PL    ~(1 << 0)
#else
#define  MG1_5_11PL    0xFFFF
#endif

#if (G1_2PL >= G1_5PL) || (G1_2PL == 0)
#define  MG1_5_12PL    ~(1 << 1)
#else
#define  MG1_5_12PL    0xFFFF
#endif

#if (G1_3PL >= G1_5PL) || (G1_3PL == 0)
#define  MG1_5_13PL    ~(1 << 2)
#else
#define  MG1_5_13PL    0xFFFF
#endif

#if (G1_4PL >= G1_5PL) || (G1_4PL == 0)
#define  MG1_5_14PL    ~(1 << 3)
#else
#define  MG1_5_14PL    0xFFFF
#endif

#if (G1_6PL >= G1_5PL) || (G1_6PL == 0)
#define  MG1_5_16PL    ~(1 << 5)
#else
#define  MG1_5_16PL    0xFFFF
#endif

#if (G1_7PL >= G1_5PL) || (G1_7PL == 0)
#define  MG1_5_17PL    ~(1 << 6)
#else
#define  MG1_5_17PL    0xFFFF
#endif

#if (G1_8PL >= G1_5PL) || (G1_8PL == 0)
#define  MG1_5_18PL    ~(1 << 7)
#else
#define  MG1_5_18PL    0xFFFF
#endif

#if (G1_9PL >= G1_5PL) || (G1_9PL == 0)
#define  MG1_5_19PL    ~(1 << 8)
#else
#define  MG1_5_19PL    0xFFFF
#endif

#if (G1_10PL >= G1_5PL) || (G1_10PL == 0)
#define  MG1_5_110PL    ~(1 << 9)
#else
#define  MG1_5_110PL    0xFFFF
#endif

#if (G1_11PL >= G1_5PL) || (G1_11PL == 0)
#define  MG1_5_111PL    ~(1 << 10)
#else
#define  MG1_5_111PL    0xFFFF
#endif

#if (G1_12PL >= G1_5PL) || (G1_12PL == 0)
#define  MG1_5_112PL    ~(1 << 11)
#else
#define  MG1_5_112PL    0xFFFF
#endif

#if (G1_13PL >= G1_5PL) || (G1_13PL == 0)
#define  MG1_5_113PL    ~(1 << 12)
#else
#define  MG1_5_113PL    0xFFFF
#endif

#if (G1_14PL >= G1_5PL) || (G1_14PL == 0)
#define  MG1_5_114PL    ~(1 << 13)
#else
#define  MG1_5_114PL    0xFFFF
#endif

#if (G1_15PL >= G1_5PL) || (G1_15PL == 0)
#define  MG1_5_115PL    ~(1 << 14)
#else
#define  MG1_5_115PL    0xFFFF
#endif

#if (G1_16PL >= G1_5PL) || (G1_16PL == 0)
#define  MG1_5_116PL    ~(1 << 15)
#else
#define  MG1_5_116PL    0xFFFF
#endif

#define  MG1_5_15PL	0xFFEF
#define  MG1_5    (MG1_5_11PL & MG1_5_12PL & MG1_5_13PL & MG1_5_14PL & \
                    MG1_5_15PL & MG1_5_16PL & MG1_5_17PL & MG1_5_18PL & \
                    MG1_5_19PL & MG1_5_110PL & MG1_5_111PL & MG1_5_112PL & \
                    MG1_5_113PL & MG1_5_114PL & MG1_5_115PL & MG1_5_116PL)
// End of MG1_5:
// Beginning of MG16:
#if (G1_1PL >= G1_6PL) || (G1_1PL == 0)
#define  MG1_6_11PL    ~(1 << 0)
#else
#define  MG1_6_11PL    0xFFFF
#endif

#if (G1_2PL >= G1_6PL) || (G1_2PL == 0)
#define  MG1_6_12PL    ~(1 << 1)
#else
#define  MG1_6_12PL    0xFFFF
#endif

#if (G1_3PL >= G1_6PL) || (G1_3PL == 0)
#define  MG1_6_13PL    ~(1 << 2)
#else
#define  MG1_6_13PL    0xFFFF
#endif

#if (G1_4PL >= G1_6PL) || (G1_4PL == 0)
#define  MG1_6_14PL    ~(1 << 3)
#else
#define  MG1_6_14PL    0xFFFF
#endif

#if (G1_5PL >= G1_6PL) || (G1_5PL == 0)
#define  MG1_6_15PL    ~(1 << 4)
#else
#define  MG1_6_15PL    0xFFFF
#endif

#if (G1_7PL >= G1_6PL) || (G1_7PL == 0)
#define  MG1_6_17PL    ~(1 << 6)
#else
#define  MG1_6_17PL    0xFFFF
#endif

#if (G1_8PL >= G1_6PL) || (G1_8PL == 0)
#define  MG1_6_18PL    ~(1 << 7)
#else
#define  MG1_6_18PL    0xFFFF
#endif

#if (G1_9PL >= G1_6PL) || (G1_9PL == 0)
#define  MG1_6_19PL    ~(1 << 8)
#else
#define  MG1_6_19PL    0xFFFF
#endif

#if (G1_10PL >= G1_6PL) || (G1_10PL == 0)
#define  MG1_6_110PL    ~(1 << 9)
#else
#define  MG1_6_110PL    0xFFFF
#endif

#if (G1_11PL >= G1_6PL) || (G1_11PL == 0)
#define  MG1_6_111PL    ~(1 << 10)
#else
#define  MG1_6_111PL    0xFFFF
#endif

#if (G1_12PL >= G1_6PL) || (G1_12PL == 0)
#define  MG1_6_112PL    ~(1 << 11)
#else
#define  MG1_6_112PL    0xFFFF
#endif

#if (G1_13PL >= G1_6PL) || (G1_13PL == 0)
#define  MG1_6_113PL    ~(1 << 12)
#else
#define  MG1_6_113PL    0xFFFF
#endif

#if (G1_14PL >= G1_6PL) || (G1_14PL == 0)
#define  MG1_6_114PL    ~(1 << 13)
#else
#define  MG1_6_114PL    0xFFFF
#endif

#if (G1_15PL >= G1_6PL) || (G1_15PL == 0)
#define  MG1_6_115PL    ~(1 << 14)
#else
#define  MG1_6_115PL    0xFFFF
#endif

#if (G1_16PL >= G1_6PL) || (G1_16PL == 0)
#define  MG1_6_116PL    ~(1 << 15)
#else
#define  MG1_6_116PL    0xFFFF
#endif

#define  MG1_6_16PL	0xFFDF
#define  MG1_6    (MG1_6_11PL & MG1_6_12PL & MG1_6_13PL & MG1_6_14PL & \
                    MG1_6_15PL & MG1_6_16PL & MG1_6_17PL & MG1_6_18PL & \
                    MG1_6_19PL & MG1_6_110PL & MG1_6_111PL & MG1_6_112PL & \
                    MG1_6_113PL & MG1_6_114PL & MG1_6_115PL & MG1_6_116PL)
// End of MG1_6:
// Beginning of MG17:
#if (G1_1PL >= G1_7PL) || (G1_1PL == 0)
#define  MG1_7_11PL    ~(1 << 0)
#else
#define  MG1_7_11PL    0xFFFF
#endif

#if (G1_2PL >= G1_7PL) || (G1_2PL == 0)
#define  MG1_7_12PL    ~(1 << 1)
#else
#define  MG1_7_12PL    0xFFFF
#endif

#if (G1_3PL >= G1_7PL) || (G1_3PL == 0)
#define  MG1_7_13PL    ~(1 << 2)
#else
#define  MG1_7_13PL    0xFFFF
#endif

#if (G1_4PL >= G1_7PL) || (G1_4PL == 0)
#define  MG1_7_14PL    ~(1 << 3)
#else
#define  MG1_7_14PL    0xFFFF
#endif

#if (G1_5PL >= G1_7PL) || (G1_5PL == 0)
#define  MG1_7_15PL    ~(1 << 4)
#else
#define  MG1_7_15PL    0xFFFF
#endif

#if (G1_6PL >= G1_7PL) || (G1_6PL == 0)
#define  MG1_7_16PL    ~(1 << 5)
#else
#define  MG1_7_16PL    0xFFFF
#endif

#if (G1_8PL >= G1_7PL) || (G1_8PL == 0)
#define  MG1_7_18PL    ~(1 << 7)
#else
#define  MG1_7_18PL    0xFFFF
#endif

#if (G1_9PL >= G1_7PL) || (G1_9PL == 0)
#define  MG1_7_19PL    ~(1 << 8)
#else
#define  MG1_7_19PL    0xFFFF
#endif

#if (G1_10PL >= G1_7PL) || (G1_10PL == 0)
#define  MG1_7_110PL    ~(1 << 9)
#else
#define  MG1_7_110PL    0xFFFF
#endif

#if (G1_11PL >= G1_7PL) || (G1_11PL == 0)
#define  MG1_7_111PL    ~(1 << 10)
#else
#define  MG1_7_111PL    0xFFFF
#endif

