dblockil42/UsingF28379D_ForMechatronics/C2000Ware_4_01_00_00/device_support/f2837xd/examples/cpu1/boostxl_afe031_f28379d_rx/cpu01/boostxl_afe031_f28379d_rx_isr.h
#if (G2_13PL >= G2_6PL) || (G2_13PL == 0)
#define  MG2_6_113PL    ~(1 << 12)
#else
#define  MG2_6_113PL    0xFFFF
#endif

#if (G2_14PL >= G2_6PL) || (G2_14PL == 0)
#define  MG2_6_114PL    ~(1 << 13)
#else
#define  MG2_6_114PL    0xFFFF
#endif

#if (G2_15PL >= G2_6PL) || (G2_15PL == 0)
#define  MG2_6_115PL    ~(1 << 14)
#else
#define  MG2_6_115PL    0xFFFF
#endif

#if (G2_16PL >= G2_6PL) || (G2_16PL == 0)
#define  MG2_6_116PL    ~(1 << 15)
#else
#define  MG2_6_116PL    0xFFFF
#endif

#define  MG2_6_16PL	0xFFDF
#define  MG2_6    (MG2_6_11PL & MG2_6_12PL & MG2_6_13PL & MG2_6_14PL & \
                    MG2_6_15PL & MG2_6_16PL & MG2_6_17PL & MG2_6_18PL & \
                    MG2_6_19PL & MG2_6_110PL & MG2_6_111PL & MG2_6_112PL & \
                    MG2_6_113PL & MG2_6_114PL & MG2_6_115PL & MG2_6_116PL)
// End of MG2_6:
// Beginning of MG27:
#if (G2_1PL >= G2_7PL) || (G2_1PL == 0)
#define  MG2_7_11PL    ~(1 << 0)
#else
#define  MG2_7_11PL    0xFFFF
#endif

#if (G2_2PL >= G2_7PL) || (G2_2PL == 0)
#define  MG2_7_12PL    ~(1 << 1)
#else
#define  MG2_7_12PL    0xFFFF
#endif

#if (G2_3PL >= G2_7PL) || (G2_3PL == 0)
#define  MG2_7_13PL    ~(1 << 2)
#else
#define  MG2_7_13PL    0xFFFF
#endif

#if (G2_4PL >= G2_7PL) || (G2_4PL == 0)
#define  MG2_7_14PL    ~(1 << 3)
#else
#define  MG2_7_14PL    0xFFFF
#endif

#if (G2_5PL >= G2_7PL) || (G2_5PL == 0)
#define  MG2_7_15PL    ~(1 << 4)
#else
#define  MG2_7_15PL    0xFFFF
#endif

#if (G2_6PL >= G2_7PL) || (G2_6PL == 0)
#define  MG2_7_16PL    ~(1 << 5)
#else
#define  MG2_7_16PL    0xFFFF
#endif

#if (G2_8PL >= G2_7PL) || (G2_8PL == 0)
#define  MG2_7_18PL    ~(1 << 7)
#else
#define  MG2_7_18PL    0xFFFF
#endif

#if (G2_9PL >= G2_7PL) || (G2_9PL == 0)
#define  MG2_7_19PL    ~(1 << 8)
#else
#define  MG2_7_19PL    0xFFFF
#endif

#if (G2_10PL >= G2_7PL) || (G2_10PL == 0)
#define  MG2_7_110PL    ~(1 << 9)
#else
#define  MG2_7_110PL    0xFFFF
#endif

#if (G2_11PL >= G2_7PL) || (G2_11PL == 0)
#define  MG2_7_111PL    ~(1 << 10)
#else
#define  MG2_7_111PL    0xFFFF
#endif

#if (G2_12PL >= G2_7PL) || (G2_12PL == 0)
#define  MG2_7_112PL    ~(1 << 11)
#else
#define  MG2_7_112PL    0xFFFF
#endif

#if (G2_13PL >= G2_7PL) || (G2_13PL == 0)
#define  MG2_7_113PL    ~(1 << 12)
#else
#define  MG2_7_113PL    0xFFFF
#endif

#if (G2_14PL >= G2_7PL) || (G2_14PL == 0)
#define  MG2_7_114PL    ~(1 << 13)
#else
#define  MG2_7_114PL    0xFFFF
#endif

#if (G2_15PL >= G2_7PL) || (G2_15PL == 0)
#define  MG2_7_115PL    ~(1 << 14)
#else
#define  MG2_7_115PL    0xFFFF
#endif

#if (G2_16PL >= G2_7PL) || (G2_16PL == 0)
#define  MG2_7_116PL    ~(1 << 15)
#else
#define  MG2_7_116PL    0xFFFF
#endif

#define  MG2_7_17PL	0xFFBF
#define  MG2_7    (MG2_7_11PL & MG2_7_12PL & MG2_7_13PL & MG2_7_14PL & \
                    MG2_7_15PL & MG2_7_16PL & MG2_7_17PL & MG2_7_18PL & \
                    MG2_7_19PL & MG2_7_110PL & MG2_7_111PL & MG2_7_112PL & \
                    MG2_7_113PL & MG2_7_114PL & MG2_7_115PL & MG2_7_116PL)
// End of MG2_7:
// Beginning of MG28:
#if (G2_1PL >= G2_8PL) || (G2_1PL == 0)
#define  MG2_8_11PL    ~(1 << 0)
#else
#define  MG2_8_11PL    0xFFFF
#endif

#if (G2_2PL >= G2_8PL) || (G2_2PL == 0)
#define  MG2_8_12PL    ~(1 << 1)
#else
#define  MG2_8_12PL    0xFFFF
#endif

#if (G2_3PL >= G2_8PL) || (G2_3PL == 0)
#define  MG2_8_13PL    ~(1 << 2)
#else
#define  MG2_8_13PL    0xFFFF
#endif

#if (G2_4PL >= G2_8PL) || (G2_4PL == 0)
#define  MG2_8_14PL    ~(1 << 3)
#else
#define  MG2_8_14PL    0xFFFF
#endif

#if (G2_5PL >= G2_8PL) || (G2_5PL == 0)
#define  MG2_8_15PL    ~(1 << 4)
#else
#define  MG2_8_15PL    0xFFFF
#endif

#if (G2_6PL >= G2_8PL) || (G2_6PL == 0)
#define  MG2_8_16PL    ~(1 << 5)
#else
#define  MG2_8_16PL    0xFFFF
#endif

#if (G2_7PL >= G2_8PL) || (G2_7PL == 0)
#define  MG2_8_17PL    ~(1 << 6)
#else
#define  MG2_8_17PL    0xFFFF
#endif

#if (G2_9PL >= G2_8PL) || (G2_9PL == 0)
#define  MG2_8_19PL    ~(1 << 8)
#else
#define  MG2_8_19PL    0xFFFF
#endif

#if (G2_10PL >= G2_8PL) || (G2_10PL == 0)
#define  MG2_8_110PL    ~(1 << 9)
#else
#define  MG2_8_110PL    0xFFFF
#endif

#if (G2_11PL >= G2_8PL) || (G2_11PL == 0)
#define  MG2_8_111PL    ~(1 << 10)
#else
#define  MG2_8_111PL    0xFFFF
#endif

#if (G2_12PL >= G2_8PL) || (G2_12PL == 0)
#define  MG2_8_112PL    ~(1 << 11)
#else
#define  MG2_8_112PL    0xFFFF
#endif

#if (G2_13PL >= G2_8PL) || (G2_13PL == 0)
#define  MG2_8_113PL    ~(1 << 12)
#else
#define  MG2_8_113PL    0xFFFF
#endif

#if (G2_14PL >= G2_8PL) || (G2_14PL == 0)
#define  MG2_8_114PL    ~(1 << 13)
#else
#define  MG2_8_114PL    0xFFFF
#endif

#if (G2_15PL >= G2_8PL) || (G2_15PL == 0)
#define  MG2_8_115PL    ~(1 << 14)
#else
#define  MG2_8_115PL    0xFFFF
#endif

#if (G2_16PL >= G2_8PL) || (G2_16PL == 0)
#define  MG2_8_116PL    ~(1 << 15)
#else
#define  MG2_8_116PL    0xFFFF
#endif

#define  MG2_8_18PL	0xFF7F
#define  MG2_8    (MG2_8_11PL & MG2_8_12PL & MG2_8_13PL & MG2_8_14PL & \
                    MG2_8_15PL & MG2_8_16PL & MG2_8_17PL & MG2_8_18PL & \
                    MG2_8_19PL & MG2_8_110PL & MG2_8_111PL & MG2_8_112PL & \
                    MG2_8_113PL & MG2_8_114PL & MG2_8_115PL & MG2_8_116PL)
// End of MG2_8:
// Beginning of MG29:
#if (G2_1PL >= G2_9PL) || (G2_1PL == 0)
#define  MG2_9_11PL    ~(1 << 0)
#else
#define  MG2_9_11PL    0xFFFF
#endif

#if (G2_2PL >= G2_9PL) || (G2_2PL == 0)
#define  MG2_9_12PL    ~(1 << 1)
#else
#define  MG2_9_12PL    0xFFFF
#endif

#if (G2_3PL >= G2_9PL) || (G2_3PL == 0)
#define  MG2_9_13PL    ~(1 << 2)
#else
#define  MG2_9_13PL    0xFFFF
#endif

#if (G2_4PL >= G2_9PL) || (G2_4PL == 0)
#define  MG2_9_14PL    ~(1 << 3)
#else
#define  MG2_9_14PL    0xFFFF
#endif

#if (G2_5PL >= G2_9PL) || (G2_5PL == 0)
#define  MG2_9_15PL    ~(1 << 4)
#else
#define  MG2_9_15PL    0xFFFF
#endif

#if (G2_6PL >= G2_9PL) || (G2_6PL == 0)
#define  MG2_9_16PL    ~(1 << 5)
#else
#define  MG2_9_16PL    0xFFFF
#endif

#if (G2_7PL >= G2_9PL) || (G2_7PL == 0)
#define  MG2_9_17PL    ~(1 << 6)
#else
#define  MG2_9_17PL    0xFFFF
#endif

#if (G2_8PL >= G2_9PL) || (G2_8PL == 0)
#define  MG2_9_18PL    ~(1 << 7)
#else
#define  MG2_9_18PL    0xFFFF
#endif

#if (G2_10PL >= G2_9PL) || (G2_10PL == 0)
#define  MG2_9_110PL    ~(1 << 9)
#else
#define  MG2_9_110PL    0xFFFF
#endif

#if (G2_11PL >= G2_9PL) || (G2_11PL == 0)
#define  MG2_9_111PL    ~(1 << 10)
#else
#define  MG2_9_111PL    0xFFFF
#endif

#if (G2_12PL >= G2_9PL) || (G2_12PL == 0)
#define  MG2_9_112PL    ~(1 << 11)
#else
#define  MG2_9_112PL    0xFFFF
#endif

