dblockil42/UsingF28379D_ForMechatronics/C2000Ware_4_01_00_00/device_support/f2837xd/examples/cpu1/boostxl_afe031_f28379d_rx/cpu01/boostxl_afe031_f28379d_rx_isr.h
#if (G3_7PL >= G3_16PL) || (G3_7PL == 0)
#define  MG3_16_17PL    ~(1 << 6)
#else
#define  MG3_16_17PL    0xFFFF
#endif

#if (G3_8PL >= G3_16PL) || (G3_8PL == 0)
#define  MG3_16_18PL    ~(1 << 7)
#else
#define  MG3_16_18PL    0xFFFF
#endif

#if (G3_9PL >= G3_16PL) || (G3_9PL == 0)
#define  MG3_16_19PL    ~(1 << 8)
#else
#define  MG3_16_19PL    0xFFFF
#endif

#if (G3_10PL >= G3_16PL) || (G3_10PL == 0)
#define  MG3_16_110PL    ~(1 << 9)
#else
#define  MG3_16_110PL    0xFFFF
#endif

#if (G3_11PL >= G3_16PL) || (G3_11PL == 0)
#define  MG3_16_111PL    ~(1 << 10)
#else
#define  MG3_16_111PL    0xFFFF
#endif

#if (G3_12PL >= G3_16PL) || (G3_12PL == 0)
#define  MG3_16_112PL    ~(1 << 11)
#else
#define  MG3_16_112PL    0xFFFF
#endif

#if (G3_13PL >= G3_16PL) || (G3_13PL == 0)
#define  MG3_16_113PL    ~(1 << 12)
#else
#define  MG3_16_113PL    0xFFFF
#endif

#if (G3_14PL >= G3_16PL) || (G3_14PL == 0)
#define  MG3_16_114PL    ~(1 << 13)
#else
#define  MG3_16_114PL    0xFFFF
#endif

#if (G3_15PL >= G3_16PL) || (G3_15PL == 0)
#define  MG3_16_115PL    ~(1 << 14)
#else
#define  MG3_16_115PL    0xFFFF
#endif

#define  MG3_16_116PL	0x7FFF
#define  MG3_16    (MG3_16_11PL & MG3_16_12PL & MG3_16_13PL & MG3_16_14PL & \
                    MG3_16_15PL & MG3_16_16PL & MG3_16_17PL & MG3_16_18PL & \
                    MG3_16_19PL & MG3_16_110PL & MG3_16_111PL & MG3_16_112PL & \
                    MG3_16_113PL & MG3_16_114PL & MG3_16_115PL & MG3_16_116PL)
// End of MG3_16:


//
// Automatically generate PIEIER4 interrupt masks MG41 to MG416:
//

// Beginning of MG41:
#if (G4_2PL >= G4_1PL) || (G4_2PL == 0)
#define  MG4_1_12PL    ~(1 << 1)
#else
#define  MG4_1_12PL    0xFFFF
#endif

#if (G4_3PL >= G4_1PL) || (G4_3PL == 0)
#define  MG4_1_13PL    ~(1 << 2)
#else
#define  MG4_1_13PL    0xFFFF
#endif

#if (G4_4PL >= G4_1PL) || (G4_4PL == 0)
#define  MG4_1_14PL    ~(1 << 3)
#else
#define  MG4_1_14PL    0xFFFF
#endif

#if (G4_5PL >= G4_1PL) || (G4_5PL == 0)
#define  MG4_1_15PL    ~(1 << 4)
#else
#define  MG4_1_15PL    0xFFFF
#endif

#if (G4_6PL >= G4_1PL) || (G4_6PL == 0)
#define  MG4_1_16PL    ~(1 << 5)
#else
#define  MG4_1_16PL    0xFFFF
#endif

#if (G4_7PL >= G4_1PL) || (G4_7PL == 0)
#define  MG4_1_17PL    ~(1 << 6)
#else
#define  MG4_1_17PL    0xFFFF
#endif

#if (G4_8PL >= G4_1PL) || (G4_8PL == 0)
#define  MG4_1_18PL    ~(1 << 7)
#else
#define  MG4_1_18PL    0xFFFF
#endif

#if (G4_9PL >= G4_1PL) || (G4_9PL == 0)
#define  MG4_1_19PL    ~(1 << 8)
#else
#define  MG4_1_19PL    0xFFFF
#endif

#if (G4_10PL >= G4_1PL) || (G4_10PL == 0)
#define  MG4_1_110PL    ~(1 << 9)
#else
#define  MG4_1_110PL    0xFFFF
#endif

#if (G4_11PL >= G4_1PL) || (G4_11PL == 0)
#define  MG4_1_111PL    ~(1 << 10)
#else
#define  MG4_1_111PL    0xFFFF
#endif

#if (G4_12PL >= G4_1PL) || (G4_12PL == 0)
#define  MG4_1_112PL    ~(1 << 11)
#else
#define  MG4_1_112PL    0xFFFF
#endif

#if (G4_13PL >= G4_1PL) || (G4_13PL == 0)
#define  MG4_1_113PL    ~(1 << 12)
#else
#define  MG4_1_113PL    0xFFFF
#endif

#if (G4_14PL >= G4_1PL) || (G4_14PL == 0)
#define  MG4_1_114PL    ~(1 << 13)
#else
#define  MG4_1_114PL    0xFFFF
#endif

#if (G4_15PL >= G4_1PL) || (G4_15PL == 0)
#define  MG4_1_115PL    ~(1 << 14)
#else
#define  MG4_1_115PL    0xFFFF
#endif

#if (G4_16PL >= G4_1PL) || (G4_16PL == 0)
#define  MG4_1_116PL    ~(1 << 15)
#else
#define  MG4_1_116PL    0xFFFF
#endif

#define  MG4_1_11PL	0xFFFE
#define  MG4_1    (MG4_1_11PL & MG4_1_12PL & MG4_1_13PL & MG4_1_14PL & \
                    MG4_1_15PL & MG4_1_16PL & MG4_1_17PL & MG4_1_18PL & \
                    MG4_1_19PL & MG4_1_110PL & MG4_1_111PL & MG4_1_112PL & \
                    MG4_1_113PL & MG4_1_114PL & MG4_1_115PL & MG4_1_116PL)
// End of MG4_1:
// Beginning of MG42:
#if (G4_1PL >= G4_2PL) || (G4_1PL == 0)
#define  MG4_2_11PL    ~(1 << 0)
#else
#define  MG4_2_11PL    0xFFFF
#endif

#if (G4_3PL >= G4_2PL) || (G4_3PL == 0)
#define  MG4_2_13PL    ~(1 << 2)
#else
#define  MG4_2_13PL    0xFFFF
#endif

#if (G4_4PL >= G4_2PL) || (G4_4PL == 0)
#define  MG4_2_14PL    ~(1 << 3)
#else
#define  MG4_2_14PL    0xFFFF
#endif

#if (G4_5PL >= G4_2PL) || (G4_5PL == 0)
#define  MG4_2_15PL    ~(1 << 4)
#else
#define  MG4_2_15PL    0xFFFF
#endif

#if (G4_6PL >= G4_2PL) || (G4_6PL == 0)
#define  MG4_2_16PL    ~(1 << 5)
#else
#define  MG4_2_16PL    0xFFFF
#endif

#if (G4_7PL >= G4_2PL) || (G4_7PL == 0)
#define  MG4_2_17PL    ~(1 << 6)
#else
#define  MG4_2_17PL    0xFFFF
#endif

#if (G4_8PL >= G4_2PL) || (G4_8PL == 0)
#define  MG4_2_18PL    ~(1 << 7)
#else
#define  MG4_2_18PL    0xFFFF
#endif

#if (G4_9PL >= G4_2PL) || (G4_9PL == 0)
#define  MG4_2_19PL    ~(1 << 8)
#else
#define  MG4_2_19PL    0xFFFF
#endif

#if (G4_10PL >= G4_2PL) || (G4_10PL == 0)
#define  MG4_2_110PL    ~(1 << 9)
#else
#define  MG4_2_110PL    0xFFFF
#endif

#if (G4_11PL >= G4_2PL) || (G4_11PL == 0)
#define  MG4_2_111PL    ~(1 << 10)
#else
#define  MG4_2_111PL    0xFFFF
#endif

#if (G4_12PL >= G4_2PL) || (G4_12PL == 0)
#define  MG4_2_112PL    ~(1 << 11)
#else
#define  MG4_2_112PL    0xFFFF
#endif

#if (G4_13PL >= G4_2PL) || (G4_13PL == 0)
#define  MG4_2_113PL    ~(1 << 12)
#else
#define  MG4_2_113PL    0xFFFF
#endif

#if (G4_14PL >= G4_2PL) || (G4_14PL == 0)
#define  MG4_2_114PL    ~(1 << 13)
#else
#define  MG4_2_114PL    0xFFFF
#endif

#if (G4_15PL >= G4_2PL) || (G4_15PL == 0)
#define  MG4_2_115PL    ~(1 << 14)
#else
#define  MG4_2_115PL    0xFFFF
#endif

#if (G4_16PL >= G4_2PL) || (G4_16PL == 0)
#define  MG4_2_116PL    ~(1 << 15)
#else
#define  MG4_2_116PL    0xFFFF
#endif

#define  MG4_2_12PL	0xFFFD
#define  MG4_2    (MG4_2_11PL & MG4_2_12PL & MG4_2_13PL & MG4_2_14PL & \
                    MG4_2_15PL & MG4_2_16PL & MG4_2_17PL & MG4_2_18PL & \
                    MG4_2_19PL & MG4_2_110PL & MG4_2_111PL & MG4_2_112PL & \
                    MG4_2_113PL & MG4_2_114PL & MG4_2_115PL & MG4_2_116PL)
// End of MG4_2:
// Beginning of MG43:
#if (G4_1PL >= G4_3PL) || (G4_1PL == 0)
#define  MG4_3_11PL    ~(1 << 0)
#else
#define  MG4_3_11PL    0xFFFF
#endif

#if (G4_2PL >= G4_3PL) || (G4_2PL == 0)
#define  MG4_3_12PL    ~(1 << 1)
#else
#define  MG4_3_12PL    0xFFFF
#endif

#if (G4_4PL >= G4_3PL) || (G4_4PL == 0)
#define  MG4_3_14PL    ~(1 << 3)
#else
#define  MG4_3_14PL    0xFFFF
#endif

