dblockil42/UsingF28379D_ForMechatronics/C2000Ware_4_01_00_00/device_support/f2837xd/examples/cpu1/boostxl_afe031_f28379d_rx/cpu01/boostxl_afe031_f28379d_rx_isr.h
#if (G4_11PL >= G4_6PL) || (G4_11PL == 0)
#define  MG4_6_111PL    ~(1 << 10)
#else
#define  MG4_6_111PL    0xFFFF
#endif

#if (G4_12PL >= G4_6PL) || (G4_12PL == 0)
#define  MG4_6_112PL    ~(1 << 11)
#else
#define  MG4_6_112PL    0xFFFF
#endif

#if (G4_13PL >= G4_6PL) || (G4_13PL == 0)
#define  MG4_6_113PL    ~(1 << 12)
#else
#define  MG4_6_113PL    0xFFFF
#endif

#if (G4_14PL >= G4_6PL) || (G4_14PL == 0)
#define  MG4_6_114PL    ~(1 << 13)
#else
#define  MG4_6_114PL    0xFFFF
#endif

#if (G4_15PL >= G4_6PL) || (G4_15PL == 0)
#define  MG4_6_115PL    ~(1 << 14)
#else
#define  MG4_6_115PL    0xFFFF
#endif

#if (G4_16PL >= G4_6PL) || (G4_16PL == 0)
#define  MG4_6_116PL    ~(1 << 15)
#else
#define  MG4_6_116PL    0xFFFF
#endif

#define  MG4_6_16PL	0xFFDF
#define  MG4_6    (MG4_6_11PL & MG4_6_12PL & MG4_6_13PL & MG4_6_14PL & \
                    MG4_6_15PL & MG4_6_16PL & MG4_6_17PL & MG4_6_18PL & \
                    MG4_6_19PL & MG4_6_110PL & MG4_6_111PL & MG4_6_112PL & \
                    MG4_6_113PL & MG4_6_114PL & MG4_6_115PL & MG4_6_116PL)
// End of MG4_6:
// Beginning of MG47:
#if (G4_1PL >= G4_7PL) || (G4_1PL == 0)
#define  MG4_7_11PL    ~(1 << 0)
#else
#define  MG4_7_11PL    0xFFFF
#endif

#if (G4_2PL >= G4_7PL) || (G4_2PL == 0)
#define  MG4_7_12PL    ~(1 << 1)
#else
#define  MG4_7_12PL    0xFFFF
#endif

#if (G4_3PL >= G4_7PL) || (G4_3PL == 0)
#define  MG4_7_13PL    ~(1 << 2)
#else
#define  MG4_7_13PL    0xFFFF
#endif

#if (G4_4PL >= G4_7PL) || (G4_4PL == 0)
#define  MG4_7_14PL    ~(1 << 3)
#else
#define  MG4_7_14PL    0xFFFF
#endif

#if (G4_5PL >= G4_7PL) || (G4_5PL == 0)
#define  MG4_7_15PL    ~(1 << 4)
#else
#define  MG4_7_15PL    0xFFFF
#endif

#if (G4_6PL >= G4_7PL) || (G4_6PL == 0)
#define  MG4_7_16PL    ~(1 << 5)
#else
#define  MG4_7_16PL    0xFFFF
#endif

#if (G4_8PL >= G4_7PL) || (G4_8PL == 0)
#define  MG4_7_18PL    ~(1 << 7)
#else
#define  MG4_7_18PL    0xFFFF
#endif

#if (G4_9PL >= G4_7PL) || (G4_9PL == 0)
#define  MG4_7_19PL    ~(1 << 8)
#else
#define  MG4_7_19PL    0xFFFF
#endif

#if (G4_10PL >= G4_7PL) || (G4_10PL == 0)
#define  MG4_7_110PL    ~(1 << 9)
#else
#define  MG4_7_110PL    0xFFFF
#endif

#if (G4_11PL >= G4_7PL) || (G4_11PL == 0)
#define  MG4_7_111PL    ~(1 << 10)
#else
#define  MG4_7_111PL    0xFFFF
#endif

#if (G4_12PL >= G4_7PL) || (G4_12PL == 0)
#define  MG4_7_112PL    ~(1 << 11)
#else
#define  MG4_7_112PL    0xFFFF
#endif

#if (G4_13PL >= G4_7PL) || (G4_13PL == 0)
#define  MG4_7_113PL    ~(1 << 12)
#else
#define  MG4_7_113PL    0xFFFF
#endif

#if (G4_14PL >= G4_7PL) || (G4_14PL == 0)
#define  MG4_7_114PL    ~(1 << 13)
#else
#define  MG4_7_114PL    0xFFFF
#endif

#if (G4_15PL >= G4_7PL) || (G4_15PL == 0)
#define  MG4_7_115PL    ~(1 << 14)
#else
#define  MG4_7_115PL    0xFFFF
#endif

#if (G4_16PL >= G4_7PL) || (G4_16PL == 0)
#define  MG4_7_116PL    ~(1 << 15)
#else
#define  MG4_7_116PL    0xFFFF
#endif

#define  MG4_7_17PL	0xFFBF
#define  MG4_7    (MG4_7_11PL & MG4_7_12PL & MG4_7_13PL & MG4_7_14PL & \
                    MG4_7_15PL & MG4_7_16PL & MG4_7_17PL & MG4_7_18PL & \
                    MG4_7_19PL & MG4_7_110PL & MG4_7_111PL & MG4_7_112PL & \
                    MG4_7_113PL & MG4_7_114PL & MG4_7_115PL & MG4_7_116PL)
// End of MG4_7:
// Beginning of MG48:
#if (G4_1PL >= G4_8PL) || (G4_1PL == 0)
#define  MG4_8_11PL    ~(1 << 0)
#else
#define  MG4_8_11PL    0xFFFF
#endif

#if (G4_2PL >= G4_8PL) || (G4_2PL == 0)
#define  MG4_8_12PL    ~(1 << 1)
#else
#define  MG4_8_12PL    0xFFFF
#endif

#if (G4_3PL >= G4_8PL) || (G4_3PL == 0)
#define  MG4_8_13PL    ~(1 << 2)
#else
#define  MG4_8_13PL    0xFFFF
#endif

#if (G4_4PL >= G4_8PL) || (G4_4PL == 0)
#define  MG4_8_14PL    ~(1 << 3)
#else
#define  MG4_8_14PL    0xFFFF
#endif

#if (G4_5PL >= G4_8PL) || (G4_5PL == 0)
#define  MG4_8_15PL    ~(1 << 4)
#else
#define  MG4_8_15PL    0xFFFF
#endif

#if (G4_6PL >= G4_8PL) || (G4_6PL == 0)
#define  MG4_8_16PL    ~(1 << 5)
#else
#define  MG4_8_16PL    0xFFFF
#endif

#if (G4_7PL >= G4_8PL) || (G4_7PL == 0)
#define  MG4_8_17PL    ~(1 << 6)
#else
#define  MG4_8_17PL    0xFFFF
#endif

#if (G4_9PL >= G4_8PL) || (G4_9PL == 0)
#define  MG4_8_19PL    ~(1 << 8)
#else
#define  MG4_8_19PL    0xFFFF
#endif

#if (G4_10PL >= G4_8PL) || (G4_10PL == 0)
#define  MG4_8_110PL    ~(1 << 9)
#else
#define  MG4_8_110PL    0xFFFF
#endif

#if (G4_11PL >= G4_8PL) || (G4_11PL == 0)
#define  MG4_8_111PL    ~(1 << 10)
#else
#define  MG4_8_111PL    0xFFFF
#endif

#if (G4_12PL >= G4_8PL) || (G4_12PL == 0)
#define  MG4_8_112PL    ~(1 << 11)
#else
#define  MG4_8_112PL    0xFFFF
#endif

#if (G4_13PL >= G4_8PL) || (G4_13PL == 0)
#define  MG4_8_113PL    ~(1 << 12)
#else
#define  MG4_8_113PL    0xFFFF
#endif

#if (G4_14PL >= G4_8PL) || (G4_14PL == 0)
#define  MG4_8_114PL    ~(1 << 13)
#else
#define  MG4_8_114PL    0xFFFF
#endif

#if (G4_15PL >= G4_8PL) || (G4_15PL == 0)
#define  MG4_8_115PL    ~(1 << 14)
#else
#define  MG4_8_115PL    0xFFFF
#endif

#if (G4_16PL >= G4_8PL) || (G4_16PL == 0)
#define  MG4_8_116PL    ~(1 << 15)
#else
#define  MG4_8_116PL    0xFFFF
#endif

#define  MG4_8_18PL	0xFF7F
#define  MG4_8    (MG4_8_11PL & MG4_8_12PL & MG4_8_13PL & MG4_8_14PL & \
                    MG4_8_15PL & MG4_8_16PL & MG4_8_17PL & MG4_8_18PL & \
                    MG4_8_19PL & MG4_8_110PL & MG4_8_111PL & MG4_8_112PL & \
                    MG4_8_113PL & MG4_8_114PL & MG4_8_115PL & MG4_8_116PL)
// End of MG4_8:
// Beginning of MG49:
#if (G4_1PL >= G4_9PL) || (G4_1PL == 0)
#define  MG4_9_11PL    ~(1 << 0)
#else
#define  MG4_9_11PL    0xFFFF
#endif

#if (G4_2PL >= G4_9PL) || (G4_2PL == 0)
#define  MG4_9_12PL    ~(1 << 1)
#else
#define  MG4_9_12PL    0xFFFF
#endif

#if (G4_3PL >= G4_9PL) || (G4_3PL == 0)
#define  MG4_9_13PL    ~(1 << 2)
#else
#define  MG4_9_13PL    0xFFFF
#endif

#if (G4_4PL >= G4_9PL) || (G4_4PL == 0)
#define  MG4_9_14PL    ~(1 << 3)
#else
#define  MG4_9_14PL    0xFFFF
#endif

#if (G4_5PL >= G4_9PL) || (G4_5PL == 0)
#define  MG4_9_15PL    ~(1 << 4)
#else
#define  MG4_9_15PL    0xFFFF
#endif

#if (G4_6PL >= G4_9PL) || (G4_6PL == 0)
#define  MG4_9_16PL    ~(1 << 5)
#else
#define  MG4_9_16PL    0xFFFF
#endif

#if (G4_7PL >= G4_9PL) || (G4_7PL == 0)
#define  MG4_9_17PL    ~(1 << 6)
#else
#define  MG4_9_17PL    0xFFFF
#endif

#if (G4_8PL >= G4_9PL) || (G4_8PL == 0)
#define  MG4_9_18PL    ~(1 << 7)
#else
#define  MG4_9_18PL    0xFFFF
#endif

#if (G4_10PL >= G4_9PL) || (G4_10PL == 0)
#define  MG4_9_110PL    ~(1 << 9)
#else
#define  MG4_9_110PL    0xFFFF
#endif

