dblockil42/UsingF28379D_ForMechatronics/C2000Ware_4_01_00_00/device_support/f2837xd/examples/cpu1/boostxl_afe031_f28379d_rx/cpu01/boostxl_afe031_f28379d_rx_isr.h
#if (G4_6PL >= G4_12PL) || (G4_6PL == 0)
#define  MG4_12_16PL    ~(1 << 5)
#else
#define  MG4_12_16PL    0xFFFF
#endif

#if (G4_7PL >= G4_12PL) || (G4_7PL == 0)
#define  MG4_12_17PL    ~(1 << 6)
#else
#define  MG4_12_17PL    0xFFFF
#endif

#if (G4_8PL >= G4_12PL) || (G4_8PL == 0)
#define  MG4_12_18PL    ~(1 << 7)
#else
#define  MG4_12_18PL    0xFFFF
#endif

#if (G4_9PL >= G4_12PL) || (G4_9PL == 0)
#define  MG4_12_19PL    ~(1 << 8)
#else
#define  MG4_12_19PL    0xFFFF
#endif

#if (G4_10PL >= G4_12PL) || (G4_10PL == 0)
#define  MG4_12_110PL    ~(1 << 9)
#else
#define  MG4_12_110PL    0xFFFF
#endif

#if (G4_11PL >= G4_12PL) || (G4_11PL == 0)
#define  MG4_12_111PL    ~(1 << 10)
#else
#define  MG4_12_111PL    0xFFFF
#endif

#if (G4_13PL >= G4_12PL) || (G4_13PL == 0)
#define  MG4_12_113PL    ~(1 << 12)
#else
#define  MG4_12_113PL    0xFFFF
#endif

#if (G4_14PL >= G4_12PL) || (G4_14PL == 0)
#define  MG4_12_114PL    ~(1 << 13)
#else
#define  MG4_12_114PL    0xFFFF
#endif

#if (G4_15PL >= G4_12PL) || (G4_15PL == 0)
#define  MG4_12_115PL    ~(1 << 14)
#else
#define  MG4_12_115PL    0xFFFF
#endif

#if (G4_16PL >= G4_12PL) || (G4_16PL == 0)
#define  MG4_12_116PL    ~(1 << 15)
#else
#define  MG4_12_116PL    0xFFFF
#endif

#define  MG4_12_112PL	0xF7FF
#define  MG4_12    (MG4_12_11PL & MG4_12_12PL & MG4_12_13PL & MG4_12_14PL & \
                    MG4_12_15PL & MG4_12_16PL & MG4_12_17PL & MG4_12_18PL & \
                    MG4_12_19PL & MG4_12_110PL & MG4_12_111PL & MG4_12_112PL & \
                    MG4_12_113PL & MG4_12_114PL & MG4_12_115PL & MG4_12_116PL)
// End of MG4_12:
// Beginning of MG413:
#if (G4_1PL >= G4_13PL) || (G4_1PL == 0)
#define  MG4_13_11PL    ~(1 << 0)
#else
#define  MG4_13_11PL    0xFFFF
#endif

#if (G4_2PL >= G4_13PL) || (G4_2PL == 0)
#define  MG4_13_12PL    ~(1 << 1)
#else
#define  MG4_13_12PL    0xFFFF
#endif

#if (G4_3PL >= G4_13PL) || (G4_3PL == 0)
#define  MG4_13_13PL    ~(1 << 2)
#else
#define  MG4_13_13PL    0xFFFF
#endif

#if (G4_4PL >= G4_13PL) || (G4_4PL == 0)
#define  MG4_13_14PL    ~(1 << 3)
#else
#define  MG4_13_14PL    0xFFFF
#endif

#if (G4_5PL >= G4_13PL) || (G4_5PL == 0)
#define  MG4_13_15PL    ~(1 << 4)
#else
#define  MG4_13_15PL    0xFFFF
#endif

#if (G4_6PL >= G4_13PL) || (G4_6PL == 0)
#define  MG4_13_16PL    ~(1 << 5)
#else
#define  MG4_13_16PL    0xFFFF
#endif

#if (G4_7PL >= G4_13PL) || (G4_7PL == 0)
#define  MG4_13_17PL    ~(1 << 6)
#else
#define  MG4_13_17PL    0xFFFF
#endif

#if (G4_8PL >= G4_13PL) || (G4_8PL == 0)
#define  MG4_13_18PL    ~(1 << 7)
#else
#define  MG4_13_18PL    0xFFFF
#endif

#if (G4_9PL >= G4_13PL) || (G4_9PL == 0)
#define  MG4_13_19PL    ~(1 << 8)
#else
#define  MG4_13_19PL    0xFFFF
#endif

#if (G4_10PL >= G4_13PL) || (G4_10PL == 0)
#define  MG4_13_110PL    ~(1 << 9)
#else
#define  MG4_13_110PL    0xFFFF
#endif

#if (G4_11PL >= G4_13PL) || (G4_11PL == 0)
#define  MG4_13_111PL    ~(1 << 10)
#else
#define  MG4_13_111PL    0xFFFF
#endif

#if (G4_12PL >= G4_13PL) || (G4_12PL == 0)
#define  MG4_13_112PL    ~(1 << 11)
#else
#define  MG4_13_112PL    0xFFFF
#endif

#if (G4_14PL >= G4_13PL) || (G4_14PL == 0)
#define  MG4_13_114PL    ~(1 << 13)
#else
#define  MG4_13_114PL    0xFFFF
#endif

#if (G4_15PL >= G4_13PL) || (G4_15PL == 0)
#define  MG4_13_115PL    ~(1 << 14)
#else
#define  MG4_13_115PL    0xFFFF
#endif

#if (G4_16PL >= G4_13PL) || (G4_16PL == 0)
#define  MG4_13_116PL    ~(1 << 15)
#else
#define  MG4_13_116PL    0xFFFF
#endif

#define  MG4_13_113PL	0xEFFF
#define  MG4_13    (MG4_13_11PL & MG4_13_12PL & MG4_13_13PL & MG4_13_14PL & \
                    MG4_13_15PL & MG4_13_16PL & MG4_13_17PL & MG4_13_18PL & \
                    MG4_13_19PL & MG4_13_110PL & MG4_13_111PL & MG4_13_112PL & \
                    MG4_13_113PL & MG4_13_114PL & MG4_13_115PL & MG4_13_116PL)
// End of MG4_13:
// Beginning of MG414:
#if (G4_1PL >= G4_14PL) || (G4_1PL == 0)
#define  MG4_14_11PL    ~(1 << 0)
#else
#define  MG4_14_11PL    0xFFFF
#endif

#if (G4_2PL >= G4_14PL) || (G4_2PL == 0)
#define  MG4_14_12PL    ~(1 << 1)
#else
#define  MG4_14_12PL    0xFFFF
#endif

#if (G4_3PL >= G4_14PL) || (G4_3PL == 0)
#define  MG4_14_13PL    ~(1 << 2)
#else
#define  MG4_14_13PL    0xFFFF
#endif

#if (G4_4PL >= G4_14PL) || (G4_4PL == 0)
#define  MG4_14_14PL    ~(1 << 3)
#else
#define  MG4_14_14PL    0xFFFF
#endif

#if (G4_5PL >= G4_14PL) || (G4_5PL == 0)
#define  MG4_14_15PL    ~(1 << 4)
#else
#define  MG4_14_15PL    0xFFFF
#endif

#if (G4_6PL >= G4_14PL) || (G4_6PL == 0)
#define  MG4_14_16PL    ~(1 << 5)
#else
#define  MG4_14_16PL    0xFFFF
#endif

#if (G4_7PL >= G4_14PL) || (G4_7PL == 0)
#define  MG4_14_17PL    ~(1 << 6)
#else
#define  MG4_14_17PL    0xFFFF
#endif

#if (G4_8PL >= G4_14PL) || (G4_8PL == 0)
#define  MG4_14_18PL    ~(1 << 7)
#else
#define  MG4_14_18PL    0xFFFF
#endif

#if (G4_9PL >= G4_14PL) || (G4_9PL == 0)
#define  MG4_14_19PL    ~(1 << 8)
#else
#define  MG4_14_19PL    0xFFFF
#endif

#if (G4_10PL >= G4_14PL) || (G4_10PL == 0)
#define  MG4_14_110PL    ~(1 << 9)
#else
#define  MG4_14_110PL    0xFFFF
#endif

#if (G4_11PL >= G4_14PL) || (G4_11PL == 0)
#define  MG4_14_111PL    ~(1 << 10)
#else
#define  MG4_14_111PL    0xFFFF
#endif

#if (G4_12PL >= G4_14PL) || (G4_12PL == 0)
#define  MG4_14_112PL    ~(1 << 11)
#else
#define  MG4_14_112PL    0xFFFF
#endif

#if (G4_13PL >= G4_14PL) || (G4_13PL == 0)
#define  MG4_14_113PL    ~(1 << 12)
#else
#define  MG4_14_113PL    0xFFFF
#endif

#if (G4_15PL >= G4_14PL) || (G4_15PL == 0)
#define  MG4_14_115PL    ~(1 << 14)
#else
#define  MG4_14_115PL    0xFFFF
#endif

#if (G4_16PL >= G4_14PL) || (G4_16PL == 0)
#define  MG4_14_116PL    ~(1 << 15)
#else
#define  MG4_14_116PL    0xFFFF
#endif

#define  MG4_14_114PL	0xDFFF
#define  MG4_14    (MG4_14_11PL & MG4_14_12PL & MG4_14_13PL & MG4_14_14PL & \
                    MG4_14_15PL & MG4_14_16PL & MG4_14_17PL & MG4_14_18PL & \
                    MG4_14_19PL & MG4_14_110PL & MG4_14_111PL & MG4_14_112PL & \
                    MG4_14_113PL & MG4_14_114PL & MG4_14_115PL & MG4_14_116PL)
// End of MG4_14:
// Beginning of MG415:
#if (G4_1PL >= G4_15PL) || (G4_1PL == 0)
#define  MG4_15_11PL    ~(1 << 0)
#else
#define  MG4_15_11PL    0xFFFF
#endif

#if (G4_2PL >= G4_15PL) || (G4_2PL == 0)
#define  MG4_15_12PL    ~(1 << 1)
#else
#define  MG4_15_12PL    0xFFFF
#endif

#if (G4_3PL >= G4_15PL) || (G4_3PL == 0)
#define  MG4_15_13PL    ~(1 << 2)
#else
#define  MG4_15_13PL    0xFFFF
#endif

#if (G4_4PL >= G4_15PL) || (G4_4PL == 0)
#define  MG4_15_14PL    ~(1 << 3)
#else
#define  MG4_15_14PL    0xFFFF
#endif

#if (G4_5PL >= G4_15PL) || (G4_5PL == 0)
#define  MG4_15_15PL    ~(1 << 4)
#else
#define  MG4_15_15PL    0xFFFF
#endif

