dblockil42/UsingF28379D_ForMechatronics/C2000Ware_4_01_00_00/device_support/f2837xd/examples/cpu1/boostxl_afe031_f28379d_rx/cpu01/boostxl_afe031_f28379d_rx_isr.h
#if (G8_13PL >= G8_9PL) || (G8_13PL == 0)
#define  MG8_9_113PL    ~(1 << 12)
#else
#define  MG8_9_113PL    0xFFFF
#endif

#if (G8_14PL >= G8_9PL) || (G8_14PL == 0)
#define  MG8_9_114PL    ~(1 << 13)
#else
#define  MG8_9_114PL    0xFFFF
#endif

#if (G8_15PL >= G8_9PL) || (G8_15PL == 0)
#define  MG8_9_115PL    ~(1 << 14)
#else
#define  MG8_9_115PL    0xFFFF
#endif

#if (G8_16PL >= G8_9PL) || (G8_16PL == 0)
#define  MG8_9_116PL    ~(1 << 15)
#else
#define  MG8_9_116PL    0xFFFF
#endif

#define  MG8_9_19PL	0xFEFF
#define  MG8_9    (MG8_9_11PL & MG8_9_12PL & MG8_9_13PL & MG8_9_14PL & \
                    MG8_9_15PL & MG8_9_16PL & MG8_9_17PL & MG8_9_18PL & \
                    MG8_9_19PL & MG8_9_110PL & MG8_9_111PL & MG8_9_112PL & \
                    MG8_9_113PL & MG8_9_114PL & MG8_9_115PL & MG8_9_116PL)
// End of MG8_9:
// Beginning of MG810:
#if (G8_1PL >= G8_10PL) || (G8_1PL == 0)
#define  MG8_10_11PL    ~(1 << 0)
#else
#define  MG8_10_11PL    0xFFFF
#endif

#if (G8_2PL >= G8_10PL) || (G8_2PL == 0)
#define  MG8_10_12PL    ~(1 << 1)
#else
#define  MG8_10_12PL    0xFFFF
#endif

#if (G8_3PL >= G8_10PL) || (G8_3PL == 0)
#define  MG8_10_13PL    ~(1 << 2)
#else
#define  MG8_10_13PL    0xFFFF
#endif

#if (G8_4PL >= G8_10PL) || (G8_4PL == 0)
#define  MG8_10_14PL    ~(1 << 3)
#else
#define  MG8_10_14PL    0xFFFF
#endif

#if (G8_5PL >= G8_10PL) || (G8_5PL == 0)
#define  MG8_10_15PL    ~(1 << 4)
#else
#define  MG8_10_15PL    0xFFFF
#endif

#if (G8_6PL >= G8_10PL) || (G8_6PL == 0)
#define  MG8_10_16PL    ~(1 << 5)
#else
#define  MG8_10_16PL    0xFFFF
#endif

#if (G8_7PL >= G8_10PL) || (G8_7PL == 0)
#define  MG8_10_17PL    ~(1 << 6)
#else
#define  MG8_10_17PL    0xFFFF
#endif

#if (G8_8PL >= G8_10PL) || (G8_8PL == 0)
#define  MG8_10_18PL    ~(1 << 7)
#else
#define  MG8_10_18PL    0xFFFF
#endif

#if (G8_9PL >= G8_10PL) || (G8_9PL == 0)
#define  MG8_10_19PL    ~(1 << 8)
#else
#define  MG8_10_19PL    0xFFFF
#endif

#if (G8_11PL >= G8_10PL) || (G8_11PL == 0)
#define  MG8_10_111PL    ~(1 << 10)
#else
#define  MG8_10_111PL    0xFFFF
#endif

#if (G8_12PL >= G8_10PL) || (G8_12PL == 0)
#define  MG8_10_112PL    ~(1 << 11)
#else
#define  MG8_10_112PL    0xFFFF
#endif

#if (G8_13PL >= G8_10PL) || (G8_13PL == 0)
#define  MG8_10_113PL    ~(1 << 12)
#else
#define  MG8_10_113PL    0xFFFF
#endif

#if (G8_14PL >= G8_10PL) || (G8_14PL == 0)
#define  MG8_10_114PL    ~(1 << 13)
#else
#define  MG8_10_114PL    0xFFFF
#endif

#if (G8_15PL >= G8_10PL) || (G8_15PL == 0)
#define  MG8_10_115PL    ~(1 << 14)
#else
#define  MG8_10_115PL    0xFFFF
#endif

#if (G8_16PL >= G8_10PL) || (G8_16PL == 0)
#define  MG8_10_116PL    ~(1 << 15)
#else
#define  MG8_10_116PL    0xFFFF
#endif

#define  MG8_10_110PL	0xFDFF
#define  MG8_10    (MG8_10_11PL & MG8_10_12PL & MG8_10_13PL & MG8_10_14PL & \
                    MG8_10_15PL & MG8_10_16PL & MG8_10_17PL & MG8_10_18PL & \
                    MG8_10_19PL & MG8_10_110PL & MG8_10_111PL & MG8_10_112PL & \
                    MG8_10_113PL & MG8_10_114PL & MG8_10_115PL & MG8_10_116PL)
// End of MG8_10:
// Beginning of MG811:
#if (G8_1PL >= G8_11PL) || (G8_1PL == 0)
#define  MG8_11_11PL    ~(1 << 0)
#else
#define  MG8_11_11PL    0xFFFF
#endif

#if (G8_2PL >= G8_11PL) || (G8_2PL == 0)
#define  MG8_11_12PL    ~(1 << 1)
#else
#define  MG8_11_12PL    0xFFFF
#endif

#if (G8_3PL >= G8_11PL) || (G8_3PL == 0)
#define  MG8_11_13PL    ~(1 << 2)
#else
#define  MG8_11_13PL    0xFFFF
#endif

#if (G8_4PL >= G8_11PL) || (G8_4PL == 0)
#define  MG8_11_14PL    ~(1 << 3)
#else
#define  MG8_11_14PL    0xFFFF
#endif

#if (G8_5PL >= G8_11PL) || (G8_5PL == 0)
#define  MG8_11_15PL    ~(1 << 4)
#else
#define  MG8_11_15PL    0xFFFF
#endif

#if (G8_6PL >= G8_11PL) || (G8_6PL == 0)
#define  MG8_11_16PL    ~(1 << 5)
#else
#define  MG8_11_16PL    0xFFFF
#endif

#if (G8_7PL >= G8_11PL) || (G8_7PL == 0)
#define  MG8_11_17PL    ~(1 << 6)
#else
#define  MG8_11_17PL    0xFFFF
#endif

#if (G8_8PL >= G8_11PL) || (G8_8PL == 0)
#define  MG8_11_18PL    ~(1 << 7)
#else
#define  MG8_11_18PL    0xFFFF
#endif

#if (G8_9PL >= G8_11PL) || (G8_9PL == 0)
#define  MG8_11_19PL    ~(1 << 8)
#else
#define  MG8_11_19PL    0xFFFF
#endif

#if (G8_10PL >= G8_11PL) || (G8_10PL == 0)
#define  MG8_11_110PL    ~(1 << 9)
#else
#define  MG8_11_110PL    0xFFFF
#endif

#if (G8_12PL >= G8_11PL) || (G8_12PL == 0)
#define  MG8_11_112PL    ~(1 << 11)
#else
#define  MG8_11_112PL    0xFFFF
#endif

#if (G8_13PL >= G8_11PL) || (G8_13PL == 0)
#define  MG8_11_113PL    ~(1 << 12)
#else
#define  MG8_11_113PL    0xFFFF
#endif

#if (G8_14PL >= G8_11PL) || (G8_14PL == 0)
#define  MG8_11_114PL    ~(1 << 13)
#else
#define  MG8_11_114PL    0xFFFF
#endif

#if (G8_15PL >= G8_11PL) || (G8_15PL == 0)
#define  MG8_11_115PL    ~(1 << 14)
#else
#define  MG8_11_115PL    0xFFFF
#endif

#if (G8_16PL >= G8_11PL) || (G8_16PL == 0)
#define  MG8_11_116PL    ~(1 << 15)
#else
#define  MG8_11_116PL    0xFFFF
#endif

#define  MG8_11_111PL	0xFBFF
#define  MG8_11    (MG8_11_11PL & MG8_11_12PL & MG8_11_13PL & MG8_11_14PL & \
                    MG8_11_15PL & MG8_11_16PL & MG8_11_17PL & MG8_11_18PL & \
                    MG8_11_19PL & MG8_11_110PL & MG8_11_111PL & MG8_11_112PL & \
                    MG8_11_113PL & MG8_11_114PL & MG8_11_115PL & MG8_11_116PL)
// End of MG8_11:
// Beginning of MG812:
#if (G8_1PL >= G8_12PL) || (G8_1PL == 0)
#define  MG8_12_11PL    ~(1 << 0)
#else
#define  MG8_12_11PL    0xFFFF
#endif

#if (G8_2PL >= G8_12PL) || (G8_2PL == 0)
#define  MG8_12_12PL    ~(1 << 1)
#else
#define  MG8_12_12PL    0xFFFF
#endif

#if (G8_3PL >= G8_12PL) || (G8_3PL == 0)
#define  MG8_12_13PL    ~(1 << 2)
#else
#define  MG8_12_13PL    0xFFFF
#endif

#if (G8_4PL >= G8_12PL) || (G8_4PL == 0)
#define  MG8_12_14PL    ~(1 << 3)
#else
#define  MG8_12_14PL    0xFFFF
#endif

#if (G8_5PL >= G8_12PL) || (G8_5PL == 0)
#define  MG8_12_15PL    ~(1 << 4)
#else
#define  MG8_12_15PL    0xFFFF
#endif

#if (G8_6PL >= G8_12PL) || (G8_6PL == 0)
#define  MG8_12_16PL    ~(1 << 5)
#else
#define  MG8_12_16PL    0xFFFF
#endif

#if (G8_7PL >= G8_12PL) || (G8_7PL == 0)
#define  MG8_12_17PL    ~(1 << 6)
#else
#define  MG8_12_17PL    0xFFFF
#endif

#if (G8_8PL >= G8_12PL) || (G8_8PL == 0)
#define  MG8_12_18PL    ~(1 << 7)
#else
#define  MG8_12_18PL    0xFFFF
#endif

#if (G8_9PL >= G8_12PL) || (G8_9PL == 0)
#define  MG8_12_19PL    ~(1 << 8)
#else
#define  MG8_12_19PL    0xFFFF
#endif

#if (G8_10PL >= G8_12PL) || (G8_10PL == 0)
#define  MG8_12_110PL    ~(1 << 9)
#else
#define  MG8_12_110PL    0xFFFF
#endif

#if (G8_11PL >= G8_12PL) || (G8_11PL == 0)
#define  MG8_12_111PL    ~(1 << 10)
#else
#define  MG8_12_111PL    0xFFFF
#endif

#if (G8_13PL >= G8_12PL) || (G8_13PL == 0)
#define  MG8_12_113PL    ~(1 << 12)
#else
#define  MG8_12_113PL    0xFFFF
#endif

#if (G8_14PL >= G8_12PL) || (G8_14PL == 0)
#define  MG8_12_114PL    ~(1 << 13)
#else
#define  MG8_12_114PL    0xFFFF
#endif

#if (G8_15PL >= G8_12PL) || (G8_15PL == 0)
#define  MG8_12_115PL    ~(1 << 14)
#else
#define  MG8_12_115PL    0xFFFF
#endif

#if (G8_16PL >= G8_12PL) || (G8_16PL == 0)
#define  MG8_12_116PL    ~(1 << 15)
#else
#define  MG8_12_116PL    0xFFFF
#endif

#define  MG8_12_112PL	0xF7FF
#define  MG8_12    (MG8_12_11PL & MG8_12_12PL & MG8_12_13PL & MG8_12_14PL & \
                    MG8_12_15PL & MG8_12_16PL & MG8_12_17PL & MG8_12_18PL & \
                    MG8_12_19PL & MG8_12_110PL & MG8_12_111PL & MG8_12_112PL & \
                    MG8_12_113PL & MG8_12_114PL & MG8_12_115PL & MG8_12_116PL)
// End of MG8_12:
// Beginning of MG813:
#if (G8_1PL >= G8_13PL) || (G8_1PL == 0)
#define  MG8_13_11PL    ~(1 << 0)
#else
#define  MG8_13_11PL    0xFFFF
#endif

#if (G8_2PL >= G8_13PL) || (G8_2PL == 0)
#define  MG8_13_12PL    ~(1 << 1)
#else
#define  MG8_13_12PL    0xFFFF
#endif

#if (G8_3PL >= G8_13PL) || (G8_3PL == 0)
#define  MG8_13_13PL    ~(1 << 2)
#else
#define  MG8_13_13PL    0xFFFF
#endif

#if (G8_4PL >= G8_13PL) || (G8_4PL == 0)
#define  MG8_13_14PL    ~(1 << 3)
#else
#define  MG8_13_14PL    0xFFFF
#endif

#if (G8_5PL >= G8_13PL) || (G8_5PL == 0)
#define  MG8_13_15PL    ~(1 << 4)
#else
#define  MG8_13_15PL    0xFFFF
#endif

#if (G8_6PL >= G8_13PL) || (G8_6PL == 0)
#define  MG8_13_16PL    ~(1 << 5)
#else
#define  MG8_13_16PL    0xFFFF
#endif

